Vasservice/src/test/java/com/nairobisoftwarelab/sms/notification.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <v2:RequestSOAPHeader xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1">
            <spId>601572</spId>
            <spPassword>061b6a9045ef08bb4d45dd37409e35d5</spPassword>
            <serviceId>6015722000100291</serviceId>
            <timeStamp>20161025153602</timeStamp>
        </v2:RequestSOAPHeader>
    </soapenv:Header>
    <soapenv:Body>
        <ns2:startSmsNotification xmlns:ns2="http://www.csapi.org/schema/parlayx/sms/notification_manager/v2_3/local">
            <ns2:reference>
                <endpoint>http://197.232.49.214:8080/supergateway/services/SmsNotificationService</endpoint>
                <interfaceName>notifySmsReception</interfaceName>
                <correlator>0001136</correlator>
            </ns2:reference>
            <ns2:smsServiceActivationNumber>22253</ns2:smsServiceActivationNumber>
        </ns2:startSmsNotification>
    </soapenv:Body>
</soapenv:Envelope>
